app/controllers/collaborators_controller.rb

  def create
    wiki = Wiki.find(params[:wiki_id])
    user = User.find(params[:user_id])
    collaborator = Collaborator.new(wiki: wiki, user: user)
    if collaborator.save
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 27]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "collaborators" ("wiki_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["wiki_id", 27], ["user_id", 1], ["created_at", "2015-08-18 21:33:16.380365"], ["updated_at", "2015-08-18 21:33:16.380365"]]

  def destroy
    wiki = Wiki.find(params[:wiki_id])
    collaborator = wiki.collaborators.where(user_id: (params[:id])).first
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 27]]
SELECT  "collaborators".* FROM "collaborators" WHERE "collaborators"."wiki_id" = ? AND "collaborators"."user_id" = ?  ORDER BY "collaborators"."id" ASC LIMIT 1  [["wiki_id", 27], ["user_id", 27]]