app/controllers/wikis_controller.rb

  def edit
    @wiki = Wiki.find(params[:id])
     @users = User.all
---
SELECT "users".* FROM "users"