app/controllers/wikis_controller.rb

  def index
    @wikis = Wiki.all
---
SELECT "wikis".* FROM "wikis"  ORDER BY created_at DESC

  def show
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 3]]

  def create
    @wiki = Wiki.new(params.require(:wiki).permit(:title, :body))
    authorize @wiki
    if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "public", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Privateeeee"], ["body", "asdfasdfasdfasdf"], ["public", "f"], ["created_at", "2015-08-10 21:56:05.060274"], ["updated_at", "2015-08-10 21:56:05.060274"]]

  def edit
    @wiki = Wiki.find(params[:id])
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 2]]

  def update
    @wiki = Wiki.find(params[:id])
    authorize @wiki
    if @wiki.update_attributes(params.require(:wiki).permit(:title, :body))
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 19]]
UPDATE "wikis" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?  [["title", "private"], ["body", "dssdsad"], ["updated_at", "2015-08-10 21:53:28.356049"], ["id", 21]]

  def destroy
   @wiki = Wiki.find(params[:id])
   authorize @wiki
    if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 20]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 1]]